tutorials/compressible/rhoPorousMRFSimpleFoam/angledDuctImplicit/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoPorousMRFSimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         100;

deltaT          1;

writeControl    timeStep;

writeInterval   10;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

graphFormat     raw;

runTimeModifiable true;

functions
{
    residualControl1
    {
        type            residualControl;
        functionObjectLibs ( "libjobControl.so" );
        outputControl   timeStep;
        outputInterval  1;

        maxResiduals
        {
            p       1e-3;
            U       1e-4;
            T       1e-3;

            // possibly check turbulence fields
            "(k|epsilon|omega)" 1e-3;
        }
    }
}

// ************************************************************************* //
